fdfea/Capstone_MSP432/get_time.c
        /*
        App_CB.timeElapsedSec  -= TIME2013;
        App_CB.timeElapsedSec  += (gmt_hr * SEC_IN_HOUR);
        App_CB.timeElapsedSec  += (gmt_min * SEC_IN_MIN);
        App_CB.timeCCPtr = &App_CB.time[0];
        App_CB.timeSGeneralVar = App_CB.timeElapsedSec/SEC_IN_DAY;
        memcpy(App_CB.timeCCPtr, daysOfWeek2013[App_CB.timeSGeneralVar%7], 3);
        App_CB.timeCCPtr += 3;
        *App_CB.timeCCPtr++ = '\x20';
        App_CB.timeSGeneralVar %= 365;
        for (index = 0; index < 12; index++)
        {
            App_CB.timeSGeneralVar -= numOfDaysPerMonth[index];
            if (App_CB.timeSGeneralVar < 0)
                break;
        }
        memcpy(App_CB.timeCCPtr, monthOfYear[index], 3);
        App_CB.timeCCPtr += 3;
        *App_CB.timeCCPtr++ = '\x20';
        App_CB.timeSGeneralVar += numOfDaysPerMonth[index];
        App_CB.timeCCLen = itoa(App_CB.timeSGeneralVar + 1, App_CB.timeCCPtr);
        App_CB.timeCCPtr += App_CB.timeCCLen;
        *App_CB.timeCCPtr++ = '\x20';
        App_CB.timeUGeneralVar = App_CB.timeElapsedSec/SEC_IN_DAY;
        App_CB.timeUGeneralVar /= 365;
        App_CB.timeCCLen = itoa(YEAR2013 + App_CB.timeUGeneralVar , App_CB.timeCCPtr);
        App_CB.timeCCPtr += App_CB.timeCCLen;
        *App_CB.timeCCPtr++ = '\x20';
        App_CB.timeUGeneralVar = App_CB.timeElapsedSec%SEC_IN_DAY;
        App_CB.timeUGeneralVar1 = App_CB.timeUGeneralVar%SEC_IN_HOUR;
        App_CB.timeUGeneralVar /= SEC_IN_HOUR;
        App_CB.timeCCLen = itoa(App_CB.timeUGeneralVar, App_CB.timeCCPtr);
        App_CB.timeCCPtr += App_CB.timeCCLen;
        *App_CB.timeCCPtr++ = ':';
        App_CB.timeUGeneralVar = App_CB.timeUGeneralVar1/SEC_IN_MIN;
        App_CB.timeUGeneralVar1 %= SEC_IN_MIN;
        App_CB.timeCCLen = itoa(App_CB.timeUGeneralVar, App_CB.timeCCPtr);
        App_CB.timeCCPtr += App_CB.timeCCLen;
        *App_CB.timeCCPtr++ = ':';
        App_CB.timeCCLen = itoa(App_CB.timeUGeneralVar1, App_CB.timeCCPtr);
        App_CB.timeCCPtr += App_CB.timeCCLen;
        *App_CB.timeCCPtr++ = '\x20';
        *App_CB.timeCCPtr++ = '\0';

        UART_PRINT("\r\n Server ");
        UART_PRINT("%s",SNTPserver);
        UART_PRINT(" has responded with time information");
        UART_PRINT("\n\r\r\n");
        UART_PRINT("%s",App_CB.time);
        UART_PRINT("\n\r\r\n");
        */
    }

    return 0;
}

/***********************************************************
  Function: getWeather
*/
static int32_t getWeather(void)
{
    int32_t retVal = -1;

    strcpy((char *)App_CB.weatherHostName, WEATHER_SERVER);

    retVal = getHostIPforWeather();
    if(retVal < 0)
    {
        UART_PRINT("Unable to reach Host\n\r");
        ASSERT_ON_ERROR(retVal);
    }

    App_CB.weatherSockID = createConnectionforWeather();
    ASSERT_ON_ERROR(App_CB.weatherSockID);

    strcpy((char *)App_CB.weatherCityName, (const char *)flashDemoConfigParams.city);

    retVal = getForecastData();
    ASSERT_ON_ERROR(retVal);

    retVal = sl_Close(App_CB.weatherSockID);
    ASSERT_ON_ERROR(retVal);
    return 0;
}

/***********************************************************
  Function: getTime
*/
static int32_t getTime()
{
    int32_t retVal = -1;

    strcpy((char *)App_CB.timeHostName, (const char *)SNTPserver);

    retVal = getHostIPforDate();
    if(retVal < 0)
    {
        UART_PRINT(" Unable to reach Host\n\r\n\r");
        ASSERT_ON_ERROR(retVal);
    }

    App_CB.timeSockID = createConnectionforDate();
    ASSERT_ON_ERROR(App_CB.timeSockID);

    retVal = getSNTPTime(flashDemoConfigParams.gmtTimeZoneHR,
                         GMT_TIME_ZONE_MIN);
    ASSERT_ON_ERROR(retVal);

    retVal = sl_Close(App_CB.timeSockID);
    ASSERT_ON_ERROR(retVal);
    return 0;
}

static void *udpServerThreadProc(void* pArg)
{
    int32_t sd = 0;
    int32_t retVal = -1;
    SlSocklen_t ServerSize, ClientSize;
    struct SlTimeval_t TimeVal;
    SlSockAddrIn_t ServerAddr, ClientAddr;
    uint8_t dataBuf[48];

    sd = sl_Socket(SL_AF_INET, SL_SOCK_DGRAM, /*SL_IPPROTO_UDP*/ 0);
    if(sd < 0)
    {
        UART_PRINT("Socket create failed\n\r\n\r");
        return NULL;
    }

    TimeVal.tv_sec = 10;
    TimeVal.tv_usec = 0;
    sl_SetSockOpt(sd, SL_SOL_SOCKET, SL_SO_RCVTIMEO, (_u8 *)&TimeVal, sizeof(TimeVal));

    ServerSize = sizeof(ServerAddr);
    ServerAddr.sin_family = SL_AF_INET;
    ServerAddr.sin_port = sl_Htons(DATA_PORT);
    ServerAddr.sin_addr.s_addr = sl_Htonl(SL_INADDR_ANY);

    retVal = sl_Bind(sd, (SlSockAddr_t *)&ServerAddr, ServerSize);
    if (retVal < 0)
    {
        UART_PRINT("Socket bind failed\r\n");
        return NULL;
    }

    UART_PRINT("Listening on port %d...\r\n", DATA_PORT);

    while (!udpThreadStop)
    {
        ClientSize = sizeof(SlSockAddrIn_t);
        memset(&ClientAddr, 0, ClientSize);
        memset(dataBuf, 0, sizeof(dataBuf));

        retVal = sl_RecvFrom(sd, dataBuf, sizeof(dataBuf), 0,
                             (SlSockAddr_t *)&ClientAddr, (SlSocklen_t*)&ClientSize);
        if (retVal <= 0)
        {
            //UART_PRINT("Recieve timed out\n\r");
        }
        else
        {
            UART_PRINT("Recieved: %s\r\n", dataBuf);
        }
    }

    retVal = sl_Close(sd);
    if (retVal < 0)
    {
        UART_PRINT("Socket close failed\r\n");
    }
    return NULL;
}

/****************************************************************************************************************
                 Main Thread
****************************************************************************************************************/
void mainThread(void * args)
{
    int32_t retc = 0;

    /* Thread vars */
    pthread_t spawn_thread = (pthread_t) NULL;
    pthread_attr_t pAttrs_spawn;
    struct sched_param priParam;

    //pthread_mutex_t uartMutex;

    /* Peripheral parameters and handles */
    UART_Handle tUartHndl;

    /* Clear lockUDID */
    memset(&App_CB.lockUDID[0], 0x00, sizeof(App_CB.lockUDID));

    /* Initialize SlNetSock layer with CC3x20 interface                      */
    SlNetIf_init(0);
    SlNetIf_add(SLNETIF_ID_1, "CC3220", (const SlNetIf_Config_t *) &SlNetIfConfigWifi, SLNET_IF_WIFI_PRIO);

    SlNetSock_init(0);
    SlNetUtil_init(0);

