fdfea/Capstone_MSP432/get_time.c
    /* Init pins used as GPIOs */
    GPIO_init();
    /* Init SPI for communicating between M4 and NWP */
    SPI_init();

    /* Configure the UART                                                     */
    tUartHndl = InitTerm();
    /* remove uart receive from LPDS dependency                               */
    UART_control(tUartHndl, UART_CMD_RXDISABLE, NULL);

    /* Create the sl_Task                                                     */
    pthread_attr_init(&pAttrs_spawn);
    priParam.sched_priority = SPAWN_TASK_PRIORITY;
    retc |= pthread_attr_setschedparam(&pAttrs_spawn, &priParam);
    retc |= pthread_attr_setstacksize(&pAttrs_spawn, TASK_STACK_SIZE);
    retc |= pthread_attr_setdetachstate(&pAttrs_spawn, PTHREAD_CREATE_DETACHED);

    retc |= pthread_create(&spawn_thread, &pAttrs_spawn, sl_Task, NULL);
    if (retc != 0)
    {
        UART_PRINT("could not create simplelink task\n\r");
        while (1); // Insert error handling
    }

    /* Started to allow host to read back MAC address when printing App banner */
    retc = sl_Start(0, 0, 0);
    if (retc < 0)
    {
        /* Handle Error */
        UART_PRINT("\n sl_Start failed\n");
        while (1);// Insert error handling
    }

    /* Output device information to the UART terminal                         */
    retc = DisplayAppBanner(APPLICATION_NAME, APPLICATION_VERSION);

    retc = sl_Stop(SL_STOP_TIMEOUT);
    if (retc < 0)
    {
        /* Handle Error */
        UART_PRINT("\n sl_Stop failed\n");
        while (1);
    }

    /*
    retc = pthread_mutex_init(&uartMutex, NULL);
    if (retc < 0)
    {
        UART_PRINT("\r\n Mutex init failed \r\n");
        while (1);
    }
    */

    /* Main application loop */
    while (1)
    {
        UART_PRINT("\n\r\n\r**** Starting main loop ****\n\r");

        App_CB.resetApplication = false;
        App_CB.initState = 0;

        /* Connect to AP */
        UART_PRINT("Using hardcoded profile for connection.\n\r");
        App_CB.apConnectionState = WiFi_IF_Connect();

        udpThreadStop = false;
        pthread_t udpServerThread;
        pthread_attr_t udpThreadAttr;
        pthread_attr_init(&udpThreadAttr);
        retc |= pthread_attr_setstacksize(&udpThreadAttr, TASK_STACK_SIZE);
        retc |= pthread_attr_setdetachstate(&udpThreadAttr, PTHREAD_CREATE_DETACHED);
        retc |= pthread_create(&udpServerThread, &udpThreadAttr, udpServerThreadProc, NULL);
        if (retc < 0)
        {
            UART_PRINT("UDP Server create failed\r\n");
            while (1);
        }

        rtc_init();

        retc = getTime();

        App_CB.timeElapsedSec -= TZ_EST_OFFSET_SECS;

        rtc_set_time((time_t) App_CB.timeElapsedSec);

        rtc_set_alarm(6, 19, RTC_C_ALARMCONDITION_OFF, RTC_C_ALARMCONDITION_OFF);

        while (App_CB.resetApplication == false)
        {
            UART_PRINT("Date: %s\r\n", rtc_get_date());

            sleep(10);
        }

        udpThreadStop = true;

        rtc_free();

        //wait for server to stop
        pthread_join(udpServerThread, NULL);
    }
}

/*
 * Interrupt handler for RTC Alarm
 */
extern void RTC_C_IRQHandler(uintptr_t Arg)
{
    uint32_t status;

    status = MAP_RTC_C_getEnabledInterruptStatus();
    MAP_RTC_C_clearInterruptFlag(status);

    if (status & RTC_C_CLOCK_READ_READY_INTERRUPT)
    {

    }

    if (status & RTC_C_TIME_EVENT_INTERRUPT)
    {
        UART_PRINT("RTC Int: Minute Passed\r\n");

    }

    if (status & RTC_C_CLOCK_ALARM_INTERRUPT)
    {
        UART_PRINT("RTC Int: Alarm Triggered\r\n");
        //can set next alarm here
        //rtc_set_alarm(22, 18, RTC_C_ALARMCONDITION_OFF, RTC_C_ALARMCONDITION_OFF);
    }

}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
